[{"reviewer_name": ["Mirini K."], "date": ["2013-11-10"], "content": "I really wanted to like this restaurant :/My fiance and I were very excited about trying Hot Spot. We invited a few other friends and went in at 7:30pm on a Saturday night. We anticipated that there would be a wait and was told it would be no longer than an hour for our party of 5. Fast forward an hour later and we no longer see the people who had been waiting with us because they're all seated and now we're standing around with other people who came longer after us and we could swear a bunch of groups who arrived after us were seated before us.Fast foward another 30 minutes and there are a bunch of open tables that have been cleaned off and not set up. We ask the hostess stand again when we will be seated and they say that the large rush was being cleared and we'd be seated after the tables were set up. I have never seen a restaurant function this way. The busboys and servers were NOT clearing and cleaning tables one at a time and seating groups one table at a time...we literally had to wait as they cleared and set up all the tables at the same time and then seated a throng of customers. So we arrived at 7:30pm and were finally seated at 9:00pm... RIDICULOUS. If the restaurant was packed we might understand...but to stare at empty, unset-up tables for the last 30 minutes of our wait was infuriating. THE FOOD: We were so hungry and scarfed down the food. It was pretty good...nothing ridiculously impressive. The sauce bar is tiny and in one small area... so you have to wait if there are a lot of people. It might have been a better idea to have 2 sauce bars. I read previous reviews about the scallops being frozen and the subpar seafood and I'd have to agree. The beef was probably the best. If we ended things here... I'd probably give the restaurant 3 stars. 4 for food and 1 for service... and then been generous and given them 3 stars, but that's not the end of the story.THE MORNING AFTER: The reason why I gave Hot Spot 1 star.Woke up this morning and we are all having GI issues. My fiance and I have been in and out of the bathroom. We texted the other 3 members of the party and they have all been on the toilet today too. I don't know what it was...but something we all had in the hot pot gave us diarrhea. Needless to say, we will not be returning to this establishment.", "url": "http://www.yelp.com/biz/hot-spot-fairfax?start=280", "restaurant_name": ["Hot Spot - Fairfax, VA"]}]